tinic/lathe_motion_stm32/lathe_motion/src/main.cpp
#include <stdint.h>
#include <stdarg.h>
#include <stdlib.h>
#include <string.h>
#include <stdio.h>

//#define STM32

#ifdef STM32

#ifdef STM32F103xB
#include "stm32f1xx.h"
#endif  // #ifdef STM32F103xB

#ifdef STM32F767xx
#include "stm32f7xx.h"
#endif  // #ifdef STM32F767xx

// led
#define LED_DELAY_MS        128

#ifdef STM32F103xB
#define LED_PORT            GPIOC
#define LED_SET             GPIO_BSRR_BS13
#define LED_RESET           GPIO_BSRR_BR13

#define PIN_ENA_1_Z GPIOB->BSRR = GPIO_BSRR_BS15
#define PIN_ENA_0_Z GPIOB->BSRR = GPIO_BSRR_BR15

#define PIN_PUL_1_Z GPIOB->BSRR = GPIO_BSRR_BS13
#define PIN_PUL_0_Z GPIOB->BSRR = GPIO_BSRR_BR13

#define PIN_DIR_1_Z GPIOB->BSRR = GPIO_BSRR_BS14
#define PIN_DIR_0_Z GPIOB->BSRR = GPIO_BSRR_BR14

#define PIN_ENA_1_X GPIOB->BSRR = GPIO_BSRR_BS15
#define PIN_ENA_0_X GPIOB->BSRR = GPIO_BSRR_BR15

#define PIN_PUL_1_X GPIOB->BSRR = GPIO_BSRR_BS11
#define PIN_PUL_0_X GPIOB->BSRR = GPIO_BSRR_BR11

#define PIN_DIR_1_X GPIOB->BSRR = GPIO_BSRR_BS5
#define PIN_DIR_0_X GPIOB->BSRR = GPIO_BSRR_BR5

#endif   // #ifdef STM32F103xB

#ifdef STM32F767xx
#define LED_PORT            GPIOB
#define LED_SET             GPIO_BSRR_BS_14
#define LED_RESET           GPIO_BSRR_BR_14

#define PIN_ENA_1_Z GPIOE->BSRR = GPIO_BSRR_BS_9
#define PIN_ENA_0_Z GPIOE->BSRR = GPIO_BSRR_BR_9

#define PIN_PUL_1_Z GPIOE->BSRR = GPIO_BSRR_BS_10
#define PIN_PUL_0_Z GPIOE->BSRR = GPIO_BSRR_BR_10

#define PIN_DIR_1_Z GPIOE->BSRR = GPIO_BSRR_BS_11
#define PIN_DIR_0_Z GPIOE->BSRR = GPIO_BSRR_BR_11

#define PIN_ENA_1_X GPIOE->BSRR = GPIO_BSRR_BS_12
#define PIN_ENA_0_X GPIOE->BSRR = GPIO_BSRR_BR_12

#define PIN_PUL_1_X GPIOE->BSRR = GPIO_BSRR_BS_13
#define PIN_PUL_0_X GPIOE->BSRR = GPIO_BSRR_BR_13

#define PIN_DIR_1_X GPIOE->BSRR = GPIO_BSRR_BS_14
#define PIN_DIR_0_X GPIOE->BSRR = GPIO_BSRR_BR_14

#endif  // #ifdef STM32F767xx

static int16_t qep_counter() {
	return TIM3->CNT;
}

static void set_qep_counter(int16_t value) {
	TIM3->CNT = value;
}

#else  // #ifdef STM32

#include <cstdlib>
#include <deque>
#include <iostream>
#include <chrono>
#include <thread>
#include <mutex>

#include <boost/asio.hpp>
#include <boost/bind.hpp>

#define PIN_ENA_1_Z
#define PIN_ENA_0_Z

#define PIN_PUL_1_Z
#define PIN_PUL_0_Z

#define PIN_DIR_1_Z
#define PIN_DIR_0_Z

#define PIN_ENA_1_X
#define PIN_ENA_0_X

#define PIN_PUL_1_X
#define PIN_PUL_0_X

#define PIN_DIR_1_X
#define PIN_DIR_0_X

static void buffer_char(uint8_t c);

extern "C" {
	void SysTick_Handler(void);
	void TIM2_IRQHandler(void);
	void EXTI1_IRQHandler(void);
}

static std::mutex irq_mutex;

static void __disable_irq() {
	irq_mutex.lock();
}
static void __enable_irq() {
	irq_mutex.unlock();
}

static int16_t qep_counter_int16 = 0;

static int16_t qep_counter() {
	return qep_counter_int16;
}

static void set_qep_counter(int16_t value) {
	qep_counter_int16 = value;
}

class uart_listener;

static std::shared_ptr<uart_listener> uart_session;

class uart_listener {
public:
	uart_listener() :
		active(false),
		socket(service),
		acceptor(service, boost::asio::ip::tcp::endpoint(boost::asio::ip::address_v4::loopback(), 33333)) {
		thread = std::thread([this]() { 
			while (1) {
				acceptor.async_accept(socket, boost::bind(&uart_listener::handle_accept, this, boost::asio::placeholders::error));
				service.run(); 
				socket.close();
				service.reset(); 
			}
		});
	}
	
	virtual ~uart_listener() {
	}
	
	void handle_accept(const boost::system::error_code& err) {
		boost::asio::ip::tcp::no_delay option(true);
		socket.set_option(option);
		uint8_t buf[256] = { 0 };
		active = true;
		while (1) {
			try {
				size_t len = socket.read_some(boost::asio::buffer(buf, sizeof(buf)));
				for (int32_t c = 0; c < len; c++) {
					buffer_char(buf[c]);
				}
			}
			catch(...) {
				active = false;
				return;
			}
		}
	}
	
	void put_char(uint8_t c) {
		if (active) {
			socket.send(boost::asio::buffer(&c, sizeof(c)));
		}
	}
		
private:
	bool active;
	boost::asio::io_service service;
	std::thread thread;
	boost::asio::ip::tcp::socket socket;
	boost::asio::ip::tcp::acceptor acceptor;
};

class qenc_timer {
public:
	qenc_timer() {
		thread = std::thread([]() {
			const int32_t pulses_per_rev = 2880;
			const int32_t rpm = 500;
			const int32_t usecs = int32_t(1000000./((double(rpm)/60.0)*double(pulses_per_rev)));
			while(1) {
				std::this_thread::sleep_for(std::chrono::microseconds(usecs));
				qep_counter_int16 ++;
				TIM2_IRQHandler();
				if (qep_counter_int16 == pulses_per_rev) {
					EXTI1_IRQHandler();
				}
			}
	 	});
	}

private:
	std::thread thread;
};

static std::shared_ptr<qenc_timer> qenc_session;

class systick_timer {
public:
	systick_timer() {
		thread = std::thread([]() {
			while(1) {
			
				std::this_thread::sleep_for(std::chrono::milliseconds(1));
				SysTick_Handler();
			}
	 	});
	}
private:
	std::thread thread;
};

static std::shared_ptr<systick_timer> systick_session;

#endif  // #ifdef STM32

static uint32_t parse_hex08(const uint8_t *buf) {
	uint32_t value = 0;
	for (uint32_t c=0; c<8; c++) {
		if (buf[c] >= 0x30 && buf[c] <= 0x39) {
			value |= (buf[c] - 0x30       ) << ((7-c)*4);
		} else if (buf[c] >= 0x41 && buf[c] <= 0x46) {
			value |= (buf[c] - 0x41 + 0x0A) << ((7-c)*4);
		} else if (buf[c] >= 0x61 && buf[c] <= 0x66) {
			value |= (buf[c] - 0x61 + 0x0A) << ((7-c)*4);
		}
	}
	return value;
}

static uint32_t parse_hex04(const uint8_t *buf) {
	uint32_t value = 0;
	for (uint32_t c=0; c<4; c++) {
		if (buf[c] >= 0x30 && buf[c] <= 0x39) {
			value |= (buf[c] - 0x30       ) << ((7-c)*4);
		} else if (buf[c] >= 0x41 && buf[c] <= 0x46) {
			value |= (buf[c] - 0x41 + 0x0A) << ((7-c)*4);
		} else if (buf[c] >= 0x61 && buf[c] <= 0x66) {
			value |= (buf[c] - 0x61 + 0x0A) << ((7-c)*4);
		}
	}
	return value;
}

static uint32_t parse_hex02(const uint8_t *buf) {
	uint32_t value = 0;
	for (uint32_t c=0; c<2; c++) {
		if (buf[c] >= 0x30 && buf[c] <= 0x39) {
			value |= (buf[c] - 0x30       ) << ((7-c)*4);
		} else if (buf[c] >= 0x41 && buf[c] <= 0x46) {
			value |= (buf[c] - 0x41 + 0x0A) << ((7-c)*4);
		} else if (buf[c] >= 0x61 && buf[c] <= 0x66) {
			value |= (buf[c] - 0x61 + 0x0A) << ((7-c)*4);
		}
	}
	return value;
}

