tinic/lathe_motion_stm32/lathe_motion/src/main.cpp
static void write_hex08(uint8_t *buf, uint32_t value) {
	static const char *ntoh = "0123456789ABCDEF";
	for (uint32_t c=0; c<8; c++) {
		*buf++ = ntoh[(value >> ((7-c)*4)) & 0x0F];
	}
}

static void write_hex04(uint8_t *buf, uint16_t value) {
	static const char *ntoh = "0123456789ABCDEF";
	for (uint32_t c=0; c<4; c++) {
		*buf++ = ntoh[(value >> ((3-c)*4)) & 0x0F];
	}
}

static void write_hex02(uint8_t *buf, uint8_t value) {
	static const char *ntoh = "0123456789ABCDEF";
	for (uint32_t c=0; c<2; c++) {
		*buf++ = ntoh[(value >> ((1-c)*4)) & 0x0F];
	}
}

static uint32_t gcd_impl(uint32_t u, uint32_t v)
{
    int shift;
    if (u == 0) return v;
    if (v == 0) return u;
    shift = __builtin_ctz(u | v);
    u >>= __builtin_ctz(u);
    do {
        v >>= __builtin_ctz(v);
        if (u > v) {
            uint32_t t = v;
            v = u;
            u = t;
        }
        v = v - u;
    } while (v != 0);
    return u << shift;
}

static int32_t gcd(int32_t u, int32_t v) {
    return int32_t(gcd_impl(abs(u),abs(v)));
}

static inline uint32_t divlu(uint32_t u1, uint32_t u0, uint32_t v) {
	const uint32_t b = 65536;
 
	int32_t s = __builtin_clz(v);

	v = v << s;

	uint32_t vn1 = v >> 16;
	uint32_t vn0 = v & 0xFFFF;

	uint32_t un32 = (u1 << s) | ((u0 >> (32 - s)) & ((-s) >> 31));
	uint32_t un10 = u0 << s;

	uint32_t un1 = un10 >> 16;
	uint32_t un0 = un10 & 0xFFFF;

	uint32_t q1 = un32 / vn1;

	uint32_t rhat = un32 - q1*vn1;

again1:
	if (q1 >= b || q1*vn0 > b*rhat + un1) {
		q1 = q1 - 1;
		rhat = rhat + vn1;
		if (rhat < b) {
			goto again1;
		}
	}

	uint32_t un21 = un32*b + un1 - q1*v;

	uint32_t q0 = un21 / vn1;

	rhat = un21 - q0*vn1;

again2:
	if (q0 >= b || q0*vn0 > b*rhat + un0) {
		q0 = q0 - 1;
		rhat = rhat + vn1;
		if (rhat < b) {	
			goto again2;
		}
	}

	return q1*b + q0;
}

static inline int32_t divls(int32_t u1, uint32_t u0, int32_t v) {
	int32_t uneg = u1 >> 31;
	if (uneg) {
		u0 = -u0;
		int32_t borrow = (u0 != 0);
		u1 = -u1 - borrow;
	}

	int32_t vneg = v >> 31;
	v = (v ^ vneg) - vneg;

	int32_t q = divlu(u1, u0, v);

	int32_t diff = uneg ^ vneg;
	q = (q ^ diff) - diff;
	return q;
}

typedef enum
{
    led_idle = 0, led_on, led_off
} led_state_t;

volatile led_state_t    led_state       = led_idle;
volatile led_state_t    led_state_next  = led_on;
volatile uint16_t       led_delay_count = 0;

//-----------------------------------------------------------------
// controller state, initialized to sane values in init_constants()
//-----------------------------------------------------------------

static const int32_t one_active_axis_timer = 0x200;
static const int32_t all_active_axis_timer = 0x280;

static int32_t absolute_pos = 0;
static int32_t absolute_idx = 0;
static int32_t absolute_tick = 0;

static int32_t current_index_delta = 0;

static int32_t wait_for_index_zero = 0;
static int32_t index_zero_occured = 0;

static int32_t absolute_pos_start_offset = 0;

static int32_t stepper_target_axis = 0;

static int32_t stepper_actual_pos_z = 0;
static int32_t stepper_end_pos_z = 0;
static int32_t stepper_off_z = 0;

static int32_t stepper_follow_mul_z = 0;
static int32_t stepper_follow_div_z = 0;

static int32_t stepper_actual_pos_x = 0;
static int32_t stepper_end_pos_x = 0;
static int32_t stepper_off_x = 0;

static int32_t stepper_follow_mul_x = 0;
static int32_t stepper_follow_div_x = 0;

static int32_t stepper_actual_pos_d = 0;
static int32_t stepper_end_pos_d = 0;
static int32_t stepper_off_d = 0;

static int32_t stepper_follow_mul_d = 0;
static int32_t stepper_follow_div_d = 0;

static int32_t cycle_counter = 0;

enum run_mode {
    run_mode_idle,
    run_mode_none,
    
    run_mode_follow_z,
    run_mode_follow_x,
    run_mode_follow_d,
    run_mode_follow_zxd,
    
    run_mode_cycle,
    run_mode_cycle_pause
};

static run_mode current_run_mode = run_mode_follow_z;
static run_mode previous_run_mode = run_mode_follow_z;

static const char int2hex[]= {
    '0','1','2','3','4','5','6','7',
    '8','9','A','B','C','D','E','F'
}; 

static uint16_t CRC16(const uint8_t *data, size_t len)
{
    static const uint16_t crcTable[] = {
        0X0000, 0XC0C1, 0XC181, 0X0140, 0XC301, 0X03C0, 0X0280, 0XC241,
        0XC601, 0X06C0, 0X0780, 0XC741, 0X0500, 0XC5C1, 0XC481, 0X0440,
        0XCC01, 0X0CC0, 0X0D80, 0XCD41, 0X0F00, 0XCFC1, 0XCE81, 0X0E40,
        0X0A00, 0XCAC1, 0XCB81, 0X0B40, 0XC901, 0X09C0, 0X0880, 0XC841,
        0XD801, 0X18C0, 0X1980, 0XD941, 0X1B00, 0XDBC1, 0XDA81, 0X1A40,
        0X1E00, 0XDEC1, 0XDF81, 0X1F40, 0XDD01, 0X1DC0, 0X1C80, 0XDC41,
        0X1400, 0XD4C1, 0XD581, 0X1540, 0XD701, 0X17C0, 0X1680, 0XD641,
        0XD201, 0X12C0, 0X1380, 0XD341, 0X1100, 0XD1C1, 0XD081, 0X1040,
        0XF001, 0X30C0, 0X3180, 0XF141, 0X3300, 0XF3C1, 0XF281, 0X3240,
        0X3600, 0XF6C1, 0XF781, 0X3740, 0XF501, 0X35C0, 0X3480, 0XF441,
        0X3C00, 0XFCC1, 0XFD81, 0X3D40, 0XFF01, 0X3FC0, 0X3E80, 0XFE41,
        0XFA01, 0X3AC0, 0X3B80, 0XFB41, 0X3900, 0XF9C1, 0XF881, 0X3840,
        0X2800, 0XE8C1, 0XE981, 0X2940, 0XEB01, 0X2BC0, 0X2A80, 0XEA41,
        0XEE01, 0X2EC0, 0X2F80, 0XEF41, 0X2D00, 0XEDC1, 0XEC81, 0X2C40,
        0XE401, 0X24C0, 0X2580, 0XE541, 0X2700, 0XE7C1, 0XE681, 0X2640,
        0X2200, 0XE2C1, 0XE381, 0X2340, 0XE101, 0X21C0, 0X2080, 0XE041,
        0XA001, 0X60C0, 0X6180, 0XA141, 0X6300, 0XA3C1, 0XA281, 0X6240,
        0X6600, 0XA6C1, 0XA781, 0X6740, 0XA501, 0X65C0, 0X6480, 0XA441,
        0X6C00, 0XACC1, 0XAD81, 0X6D40, 0XAF01, 0X6FC0, 0X6E80, 0XAE41,
        0XAA01, 0X6AC0, 0X6B80, 0XAB41, 0X6900, 0XA9C1, 0XA881, 0X6840,
        0X7800, 0XB8C1, 0XB981, 0X7940, 0XBB01, 0X7BC0, 0X7A80, 0XBA41,
        0XBE01, 0X7EC0, 0X7F80, 0XBF41, 0X7D00, 0XBDC1, 0XBC81, 0X7C40,
        0XB401, 0X74C0, 0X7580, 0XB541, 0X7700, 0XB7C1, 0XB681, 0X7640,
        0X7200, 0XB2C1, 0XB381, 0X7340, 0XB101, 0X71C0, 0X7080, 0XB041,
        0X5000, 0X90C1, 0X9181, 0X5140, 0X9301, 0X53C0, 0X5280, 0X9241,
        0X9601, 0X56C0, 0X5780, 0X9741, 0X5500, 0X95C1, 0X9481, 0X5440,
        0X9C01, 0X5CC0, 0X5D80, 0X9D41, 0X5F00, 0X9FC1, 0X9E81, 0X5E40,
        0X5A00, 0X9AC1, 0X9B81, 0X5B40, 0X9901, 0X59C0, 0X5880, 0X9841,
        0X8801, 0X48C0, 0X4980, 0X8941, 0X4B00, 0X8BC1, 0X8A81, 0X4A40,
        0X4E00, 0X8EC1, 0X8F81, 0X4F40, 0X8D01, 0X4DC0, 0X4C80, 0X8C41,
        0X4400, 0X84C1, 0X8581, 0X4540, 0X8701, 0X47C0, 0X4680, 0X8641,
        0X8201, 0X42C0, 0X4380, 0X8341, 0X4100, 0X81C1, 0X8081, 0X4040 
    };
    uint16_t crcWord = 0xFFFF;
    while (len--) {
        uint8_t d = *data++ ^ uint8_t(crcWord);
        crcWord >>= 8;
        crcWord ^= crcTable[d];
    }
    return crcWord;
}

