tinic/lathe_motion_stm32/lathe_motion/src/main.cpp
#define USART_BAUD 115200
#define USART_BUFFER_SIZE 128

static void put_char(uint8_t byte)
{
#ifdef STM32

#ifdef STM32F103xB
    USART1->DR = (int)(byte);
    while (!(USART1->SR & USART_SR_TXE));
#endif  // #ifdef STM32F103xB

#ifdef STM32F767xx
    USART1->RDR = (int)(byte);
    while (!(USART1->ISR & USART_ISR_TXE));
#endif  // #ifdef STM32F767xx

#else  // #ifdef STM32

	uart_session->put_char(byte);

#endif  // #ifdef STM32
}

typedef struct {
    uint8_t buffer[USART_BUFFER_SIZE];
    uint8_t head_pos;
    uint8_t tail_pos;
} rx_buffer_t;

volatile rx_buffer_t uart_buffer = { { 0 }, 0, 0 };

static void buffer_char(uint8_t c)
{
    __disable_irq();

    int i = (uart_buffer.head_pos + 1) % USART_BUFFER_SIZE;
    
    if (i != uart_buffer.tail_pos) {
        uart_buffer.buffer[uart_buffer.head_pos] = c;
        uart_buffer.head_pos = i;
    }

    __enable_irq();
}

static uint8_t get_char(uint8_t *c)
{
    __disable_irq();

    if(uart_buffer.head_pos == uart_buffer.tail_pos) {
        __enable_irq();
        return 0;
    }
    
    *c = uart_buffer.buffer[uart_buffer.tail_pos];
    uart_buffer.tail_pos = (uart_buffer.tail_pos + 1) % USART_BUFFER_SIZE;
    
    __enable_irq();
    return 1;
}

volatile uint32_t *DWT_CYCCNT = (uint32_t *)0xE0001004;

static void parse(void);
static void set_current_run_mode(run_mode mode);

#ifdef __cplusplus
extern "C" {
#endif  // #ifdef __cplusplus

void HardFault_Handler(void)
{
#ifdef STM32
    for (;;) {
        LED_PORT->BSRR  = LED_RESET;
    }
#endif  // #ifdef STM32
}

void BusFault_Handler(void)
{
#ifdef STM32
    for (;;) {
        LED_PORT->BSRR  = LED_RESET;
    }
#endif  // #ifdef STM32
}

void SysTick_Handler(void)
{
    absolute_tick++;
    
    parse();

#ifdef STM32
    led_delay_count = ( (led_delay_count + 1) % LED_DELAY_MS );
    if(led_delay_count == 0) {
        led_state       = led_state_next;
        led_state_next  = led_idle;
    }
    
    IWDG->KR  = 0xAAAA;

#else  // #ifdef STM32
	static int32_t counter = 0;
	if (++counter == 500) {
		counter = 0;

		printf("Z:%08d X:%08d D:%08d A:%08d I:%08d T:%08d S:%08d R:%08d\n", 
			stepper_actual_pos_z, 
			stepper_actual_pos_x, 
			stepper_actual_pos_d,
			
			absolute_pos,
			absolute_idx,
			absolute_tick,
			
			stepper_target_axis,
			
			current_run_mode
		);
	}
#endif  // #ifdef STM32
}

void USART1_IRQHandler(void)
{
#ifdef STM32

#ifdef STM32F103xB
    uint8_t in_char = (USART1->DR & 0xFF);
    buffer_char(in_char);
#endif  // #ifdef STM32F103xB

#ifdef STM32F767xx
    uint8_t in_char = (USART1->RDR & 0xFF);
    buffer_char(in_char);
#endif  // #ifdef STM32F767xx

#endif  // #ifdef STM32
}

void EXTI1_IRQHandler(void)
{
    // Core critical section, nothing shall happen here
    __disable_irq();

    int16_t cnt = qep_counter();
    set_qep_counter(0);

    absolute_pos += cnt;

    if (cnt < 0) {
        absolute_idx--;
    } else {
        absolute_idx++;
    }

#ifdef STM32
    EXTI->PR |= EXTI_PR_PR1;
#endif  // #ifdef STM32

    if (cnt == 2880 || cnt == -2880) {
        index_zero_occured = 1;
    }

    static int32_t last_absolute_tick = 0;
    current_index_delta = abs(absolute_tick - last_absolute_tick);
    last_absolute_tick = absolute_tick;
    __enable_irq();
}

static struct cycle_buffer {

	struct cycle_entry {
		uint8_t target_axs;
		uint8_t wait_for_index_zero;
		uint16_t dummy;
		int32_t target_pos;
		int32_t stepper_mul_z;
		int32_t stepper_div_z;
		int32_t stepper_mul_x;
		int32_t stepper_div_x;
		int32_t stepper_mul_d;
		int32_t stepper_div_d;
	};

	void reset() {
		buf_pos = 0;
		buf_index = 0;
		memset(&entry,0,sizeof(entry));
		next();
	}

	void clear() {
		buf_pos = 0;
		buf_len = 0;
		buf_index = 0;
		buf_index_length = 0;
		memset(&entry,0,sizeof(entry));
	}
	
	const cycle_entry &current() const {
		return entry;
	}
	
	uint32_t index() const {
		return buf_index - 1;
	}

	uint32_t index_length() const {
		return buf_index_length;
	}
	
	bool empty() const {
		return buf_len == 0;
	}
	
	bool atend() const {
		return buf_pos >= buf_len;
	}
	
	bool atlimit() const {
		return buf_len >= (sizeof(buf) - sizeof(entry));
	}
	
	#define TARGET_AXS_MASK 0x03
	#define WAIT_FOR_ZERO   0x04

	#define Z_MULDIV_CHG    0x08
	#define X_MULDIV_CHG    0x10
	#define D_MULDIV_CHG    0x20

	#define Z_MULDIV_MSK    0x03
	#define Z_MULDIV_32_FLG 0x01
	#define Z_MULDIV_24_FLG 0x02
	#define Z_MULDIV_16_FLG 0x03

	#define X_MULDIV_MSK    0x0C
	#define X_MULDIV_32_FLG 0x04
	#define X_MULDIV_24_FLG 0x08
	#define X_MULDIV_16_FLG 0x0C

	#define D_MULDIV_MSK    0x30
	#define D_MULDIV_32_FLG 0x10
	#define D_MULDIV_24_FLG 0x20
	#define D_MULDIV_16_FLG 0x30

	#define T_MSK    		0xC0
	#define T_32_FLG 		0x40
	#define T_24_FLG 		0x80
	#define T_16_FLG 		0xC0
		
	void next() {
		uint8_t flags0 = buf[buf_pos++];
		uint8_t flags1 = buf[buf_pos++];
		
		entry.target_axs = flags0 & TARGET_AXS_MASK;
		entry.wait_for_index_zero = flags0 & WAIT_FOR_ZERO;

		if ((flags1 & T_MSK) == T_32_FLG) {
			entry.target_pos = read_int32();
		} else if ((flags1 & T_MSK) == T_24_FLG) {
			entry.target_pos = read_int24();
		} else if ((flags1 & T_MSK) == T_16_FLG) {
			entry.target_pos = read_int16();
		} else {
			entry.target_pos = 0;
		}

		if ((flags0 & Z_MULDIV_CHG) != 0) {
			if ((flags1 & Z_MULDIV_MSK) == Z_MULDIV_32_FLG) {
				entry.stepper_mul_z = read_int32();
				entry.stepper_div_z = read_int32();
			} else if ((flags1 & Z_MULDIV_MSK) == Z_MULDIV_24_FLG) {
				entry.stepper_mul_z = read_int24();
				entry.stepper_div_z = read_int24();
			} else if ((flags1 & Z_MULDIV_MSK) == Z_MULDIV_16_FLG) {
				entry.stepper_mul_z = read_int16();
				entry.stepper_div_z = read_int16();
			} else {
				entry.stepper_mul_z = 0;
				entry.stepper_div_z = 0;
			}
		}

		if ((flags0 & X_MULDIV_CHG) != 0) {
			if ((flags1 & X_MULDIV_MSK) == X_MULDIV_32_FLG) {
				entry.stepper_mul_x = read_int32();
				entry.stepper_div_x = read_int32();
			} else if ((flags1 & X_MULDIV_MSK) == X_MULDIV_24_FLG) {
				entry.stepper_mul_x = read_int24();
				entry.stepper_div_x = read_int24();
			} else if ((flags1 & X_MULDIV_MSK) == X_MULDIV_16_FLG) {
				entry.stepper_mul_x = read_int16();
				entry.stepper_div_x = read_int16();
			} else {
				entry.stepper_mul_x = 0;
				entry.stepper_div_x = 0;
			}
		}

		if ((flags0 & D_MULDIV_CHG) != 0) {
			if ((flags1 & D_MULDIV_MSK) == D_MULDIV_32_FLG) {
				entry.stepper_mul_d = read_int32();
				entry.stepper_div_d = read_int32();
			} else if ((flags1 & D_MULDIV_MSK) == D_MULDIV_24_FLG) {
				entry.stepper_mul_d = read_int24();
				entry.stepper_div_d = read_int24();
			} else if ((flags1 & D_MULDIV_MSK) == D_MULDIV_16_FLG) {
				entry.stepper_mul_d = read_int16();
				entry.stepper_div_d = read_int16();
			} else {
				entry.stepper_mul_d = 0;
				entry.stepper_div_d = 0;
			}
		}
		
