tinic/lathe_motion_stm32/lathe_motion/src/main.cpp
		buf_index ++;
	}

	void push(const cycle_entry &push_entry) {
		uint8_t flags0 = push_entry.target_axs;
		uint8_t flags1 = 0;

		// always changes, so do not optimize change
		if ((abs(push_entry.target_pos) >> 25) != 0) {
			flags1 |= T_32_FLG;
		} else if ((abs(push_entry.target_pos) >> 17) != 0) {
			flags1 |= T_24_FLG;
		} else {
			flags1 |= T_16_FLG;
		}

		if (push_entry.stepper_mul_z != entry.stepper_mul_z ||
			push_entry.stepper_div_z != entry.stepper_div_z ) {
			flags0 |= Z_MULDIV_CHG;
			if (push_entry.stepper_mul_z || push_entry.stepper_div_z) {
				if (((abs(push_entry.stepper_mul_z) | abs(push_entry.stepper_div_z)) >> 25) != 0) {
					flags1 |= Z_MULDIV_32_FLG;
				} else if (((abs(push_entry.stepper_mul_z) | abs(push_entry.stepper_div_z)) >> 17) != 0) {
					flags1 |= Z_MULDIV_24_FLG;
				} else {
					flags1 |= Z_MULDIV_16_FLG;
				}
			}
		}

		if (push_entry.stepper_mul_x != entry.stepper_mul_x ||
			push_entry.stepper_div_x != entry.stepper_div_x ) {
			flags0 |= X_MULDIV_CHG;
			if (push_entry.stepper_mul_x || push_entry.stepper_div_x) {
				if (((abs(push_entry.stepper_mul_x) | abs(push_entry.stepper_div_x)) >> 25) != 0) {
					flags1 |= X_MULDIV_32_FLG;
				} else if (((abs(push_entry.stepper_mul_x) | abs(push_entry.stepper_div_x)) >> 17) != 0) {
					flags1 |= X_MULDIV_24_FLG;
				} else {
					flags1 |= X_MULDIV_16_FLG;
				}
			}
		}
		
		if (push_entry.stepper_mul_d != entry.stepper_mul_d ||
			push_entry.stepper_div_d != entry.stepper_div_d ) {
			flags0 |= D_MULDIV_CHG;
			if (push_entry.stepper_mul_d || push_entry.stepper_div_d) {
				if (((abs(push_entry.stepper_mul_d) | abs(push_entry.stepper_div_d)) >> 25) != 0) {
					flags1 |= X_MULDIV_32_FLG;
				} else if (((abs(push_entry.stepper_mul_d) | abs(push_entry.stepper_div_d)) >> 17) != 0) {
					flags1 |= X_MULDIV_24_FLG;
				} else {
					flags1 |= X_MULDIV_16_FLG;
				}
			}
		}

		flags0 |= push_entry.wait_for_index_zero ? WAIT_FOR_ZERO : 0;
		
		buf[buf_len++] = flags0;
		buf[buf_len++] = flags1;

		if ((flags1 & T_MSK) == T_32_FLG) {
			write_int32(push_entry.target_pos);
		} else if ((flags1 & T_MSK) == T_24_FLG) {
			write_int24(push_entry.target_pos);
		} else if ((flags1 & T_MSK) == T_16_FLG) {
			write_int16(push_entry.target_pos);
		}
		
		if ((flags1 & Z_MULDIV_MSK) == Z_MULDIV_32_FLG) {
			write_int32(push_entry.stepper_mul_z);
			write_int32(push_entry.stepper_div_z);
		} else if ((flags1 & Z_MULDIV_MSK) == Z_MULDIV_24_FLG) {
			write_int24(push_entry.stepper_mul_z);
			write_int24(push_entry.stepper_div_z);
		} else if ((flags1 & Z_MULDIV_MSK) == Z_MULDIV_16_FLG) {
			write_int16(push_entry.stepper_mul_z);
			write_int16(push_entry.stepper_div_z);
		} 
		
		if ((flags1 & X_MULDIV_MSK) == X_MULDIV_32_FLG) {
			write_int32(push_entry.stepper_mul_x);
			write_int32(push_entry.stepper_div_x);
		} else if ((flags1 & X_MULDIV_MSK) == X_MULDIV_24_FLG) {
			write_int24(push_entry.stepper_mul_x);
			write_int24(push_entry.stepper_div_x);
		} else if ((flags1 & X_MULDIV_MSK) == X_MULDIV_16_FLG) {
			write_int16(push_entry.stepper_mul_x);
			write_int16(push_entry.stepper_div_x);
		} 
		
		if ((flags1 & D_MULDIV_MSK) == D_MULDIV_32_FLG) {
			write_int32(push_entry.stepper_mul_d);
			write_int32(push_entry.stepper_div_d);
		} else if ((flags1 & D_MULDIV_MSK) == D_MULDIV_24_FLG) {
			write_int24(push_entry.stepper_mul_d);
			write_int24(push_entry.stepper_div_d);
		} else if ((flags1 & D_MULDIV_MSK) == D_MULDIV_16_FLG) {
			write_int16(push_entry.stepper_mul_d);
			write_int16(push_entry.stepper_div_d);
		} 
		
		entry = push_entry;
		
		buf_index_length++;
	}
	
private:

	int32_t read_int32() {
		int32_t res = int32_t((buf[buf_pos+0] << 24) | 
							  (buf[buf_pos+1] << 16) | 
							  (buf[buf_pos+2] <<  8) | 
							  (buf[buf_pos+3] <<  0)); 
		buf_pos += 4;
		return res;
	}

	int32_t read_int24() {
		int32_t res = int32_t((int32_t(int8_t(buf[buf_pos+0])) << 16) | 
							  (               buf[buf_pos+1]   <<  8) | 
							  (               buf[buf_pos+2]   <<  0)); 
		buf_pos += 3;
		return res;
	}

	int32_t read_int16() {
		int32_t res = int32_t(int16_t((buf[buf_pos+0] <<  8) | 
							          (buf[buf_pos+1] <<  0))); 
		buf_pos += 2;
		return res;
	}
	
	void write_int32(int32_t val) {
		buf[buf_len++] = (uint32_t(val) >> 24) & 0xFF;
		buf[buf_len++] = (uint32_t(val) >> 16) & 0xFF;
		buf[buf_len++] = (uint32_t(val) >>  8) & 0xFF;
		buf[buf_len++] = (uint32_t(val) >>  0) & 0xFF;
	}

	void write_int24(int32_t val) {
		buf[buf_len++] = (uint32_t(val) >> 16) & 0xFF;
		buf[buf_len++] = (uint32_t(val) >>  8) & 0xFF;
		buf[buf_len++] = (uint32_t(val) >>  0) & 0xFF;
	}

	void write_int16(int16_t val) {
		buf[buf_len++] = (uint32_t(val) >>  8) & 0xFF;
		buf[buf_len++] = (uint32_t(val) >>  0) & 0xFF;
	}

	cycle_entry entry;

#ifdef STM32

#ifdef STM32F103xB
	uint8_t buf[16384];
#endif  // #ifdef STM32F103xB

#ifdef STM32F767xx
	uint8_t buf[262144];
#endif  // #ifdef STM32F767xx

#else  // #ifdef STM32
	uint8_t buf[16384];
#endif   // #ifdef STM32

	uint32_t buf_index;
	uint32_t buf_index_length;

	uint32_t buf_pos;
	uint32_t buf_len;
} cycle_buffer;

static inline void calc_step(int32_t &stepper_target_pos, int32_t absolute_actual_pos, int32_t stepper_follow_mul, int32_t stepper_follow_div, int32_t stepper_off) {
	if (stepper_follow_mul == 0) {
		stepper_target_pos = stepper_off;      
	} else {
		int64_t u = int64_t(absolute_actual_pos) * int64_t(stepper_follow_mul);
		int32_t v = stepper_follow_div;
		stepper_target_pos = divls(int32_t(u>>32),uint32_t(u), v); 
		stepper_target_pos += stepper_off;
	}
}

static inline void reload_cycle() {
	auto &e = cycle_buffer.current();
	
	stepper_target_axis = e.target_axs;

	stepper_follow_mul_z = e.stepper_mul_z;
	stepper_follow_mul_x = e.stepper_mul_x;
	stepper_follow_mul_d = e.stepper_mul_d;

	stepper_follow_div_z = e.stepper_div_z;
	stepper_follow_div_x = e.stepper_div_x;
	stepper_follow_div_d = e.stepper_div_d;

	stepper_end_pos_z = 0;
	stepper_end_pos_x = 0;
	stepper_end_pos_d = 0;

	switch(e.target_axs) {
		case 0: {
			stepper_end_pos_z = e.target_pos;
		} break;
		case 1: {
			stepper_end_pos_x = e.target_pos;
		} break;
		case 2: {
			stepper_end_pos_d = e.target_pos;
		} break;
	}

	if (e.wait_for_index_zero) {
		wait_for_index_zero = 1;
		index_zero_occured = 0;
	}
}

