tinic/lathe_motion_stm32/lathe_motion/src/main.cpp
void TIM2_IRQHandler(void)
{
    static int32_t stepper_dir_z = 0; // direction is undefined by default
    static int32_t stepper_dir_x = 0; // direction is undefined by default
    static int32_t stepper_dir_d = 0; // direction is undefined by default

#ifdef STM32
    if ((TIM2->SR & TIM_SR_UIF)) {
        TIM2->SR &= ~(TIM_SR_UIF);

        *DWT_CYCCNT = 0;
#endif  // #ifdef STM32

        // Do nothing if we are in stop sync mode
        if (current_run_mode == run_mode_none ||
            current_run_mode == run_mode_idle) {
            return;
        }
        
        // Protect against TIM3 IRQ race
        __disable_irq();
        int16_t cnt = qep_counter();
        int32_t absolute_actual_pos = absolute_pos;

        absolute_actual_pos += cnt - absolute_pos_start_offset;

        if (wait_for_index_zero) {
            if (index_zero_occured) {
                index_zero_occured = 0;
                wait_for_index_zero = 0;
                absolute_pos_start_offset = 0;
                absolute_pos = cnt;
                absolute_actual_pos = 0;
                stepper_off_z = stepper_actual_pos_z;
                stepper_off_x = stepper_actual_pos_x;
                stepper_off_d = stepper_actual_pos_d;
            } else {
                // Do nothing until we hit index zero
                __enable_irq();
                return;
            }
        }
        __enable_irq();

        static uint32_t flip_z = 0;
        static uint32_t flip_x = 0;
        static uint32_t flip_d = 0;

		int32_t stepper_target_pos_z = stepper_actual_pos_z;
		int32_t stepper_target_pos_x = stepper_actual_pos_x;
		int32_t stepper_target_pos_d = stepper_actual_pos_d;

		if (flip_z || flip_x || flip_d) switch (current_run_mode) {
			case    run_mode_follow_zxd: {
						if (flip_z) {
							calc_step(stepper_target_pos_z, absolute_actual_pos, stepper_follow_mul_z, stepper_follow_div_z, stepper_off_z);
						}
						if (flip_x) {
							calc_step(stepper_target_pos_x, absolute_actual_pos, stepper_follow_mul_x, stepper_follow_div_x, stepper_off_x);
						}
						if (flip_d) {
							calc_step(stepper_target_pos_d, absolute_actual_pos, stepper_follow_mul_d, stepper_follow_div_d, stepper_off_d);
						}
					} break;
			case    run_mode_follow_z: {
						if (flip_z) {
							calc_step(stepper_target_pos_z, absolute_actual_pos, stepper_follow_mul_z, stepper_follow_div_z, stepper_off_z);
						}
					} break;
			case    run_mode_follow_x: {
						if (flip_x) {
							calc_step(stepper_target_pos_x, absolute_actual_pos, stepper_follow_mul_x, stepper_follow_div_x, stepper_off_x);
						}
					} break;
			case    run_mode_follow_d: {
						if (flip_d) {
							calc_step(stepper_target_pos_d, absolute_actual_pos, stepper_follow_mul_d, stepper_follow_div_d, stepper_off_d);
						}
					} break;
			case    run_mode_cycle_pause: {
						return;
					} break;
			case    run_mode_cycle: {

						bool do_next_cycle_step = false;
						switch(stepper_target_axis) {
							case 0: {
								if (stepper_follow_mul_z <= 0) {
									if (stepper_actual_pos_z >= stepper_end_pos_z) {
										do_next_cycle_step = true;
									}   
								} else {
									if (stepper_actual_pos_z <= stepper_end_pos_z) {
										do_next_cycle_step = true;
									}   
								}
							} break;
							case 1: {
								if (stepper_follow_mul_x <= 0) {
									if (stepper_actual_pos_x >= stepper_end_pos_x) {
										do_next_cycle_step = true;
									}
								} else {
									if (stepper_actual_pos_x <= stepper_end_pos_x) {
										do_next_cycle_step = true;
									}
								}
							} break;
							case 2: {
								if (stepper_follow_mul_d <= 0) {
									if (stepper_actual_pos_d >= stepper_end_pos_d) {
										do_next_cycle_step = true;
									}
								} else {
									if (stepper_actual_pos_d <= stepper_end_pos_d) {
										do_next_cycle_step = true;
									}
								}
							} break;
						}

						if (do_next_cycle_step) {
							__disable_irq();
							stepper_off_z = stepper_actual_pos_z;
							stepper_off_x = stepper_actual_pos_x;
							stepper_off_d = stepper_actual_pos_d;
							absolute_pos = 0;
							absolute_pos_start_offset = cnt;
							cycle_buffer.next();
							reload_cycle();
							__enable_irq();
							if (cycle_buffer.atend()) {
								cycle_buffer.reset();
                                set_current_run_mode(run_mode_none);
                                return;
                            }
						}

						if (flip_z) {
							calc_step(stepper_target_pos_z, absolute_actual_pos, stepper_follow_mul_z, stepper_follow_div_z, stepper_off_z);
						}
						if (flip_x) {
							calc_step(stepper_target_pos_x, absolute_actual_pos, stepper_follow_mul_x, stepper_follow_div_x, stepper_off_x);
						}
						if (flip_d) {
							calc_step(stepper_target_pos_d, absolute_actual_pos, stepper_follow_mul_d, stepper_follow_div_d, stepper_off_d);
						}

					} break;
			default: {
					} break;
		}
            
        if (flip_z) {
            int32_t szdelta = stepper_target_pos_z - stepper_actual_pos_z;
            if (szdelta < 0) {
                if (stepper_dir_z != -1) {
                    stepper_dir_z = -1;
                    PIN_DIR_0_Z;
                    // wait until next cycle to do the pulse
                } else {
                    stepper_actual_pos_z--;
                    PIN_PUL_1_Z;
                    flip_z ^= 1;
                }
            } else if (szdelta > 0) {
                if (stepper_dir_z != +1) {
                    stepper_dir_z = +1;
                    PIN_DIR_1_Z;        
                    // wait until next cycle to do the pulse
                } else {
                    // now do the actual pulse
                    stepper_actual_pos_z++;
                    PIN_PUL_1_Z;
                    flip_z ^= 1;
                }
            }
        } else {
            PIN_PUL_0_Z;
            flip_z ^= 1;
        }

        if (flip_x) {
            int32_t sxdelta = stepper_target_pos_x - stepper_actual_pos_x;
            if (sxdelta < 0) {
                if (stepper_dir_x != -1) {
                    stepper_dir_x = -1;
                    PIN_DIR_0_X;
                    // wait until next cycle to do the pulse
                } else {
                    stepper_actual_pos_x--;
                    PIN_PUL_1_X;
                    flip_x ^= 1;
                }
            } else if (sxdelta > 0) {
                if (stepper_dir_x != +1) {
                    stepper_dir_x = +1;
                    PIN_DIR_1_X;
                    // wait until next cycle to do the pulse
                } else {
                    // now do the actual pulse
                    stepper_actual_pos_x++;
                    PIN_PUL_1_X;
                    flip_x ^= 1;
                }
            }
        } else {
            PIN_PUL_0_X;
            flip_x ^= 1;
        }

        if (flip_d) {
            int32_t sddelta = stepper_target_pos_d - stepper_actual_pos_d;
            if (sddelta < 0) {
                if (stepper_dir_d != -1) {
                    stepper_dir_d = -1;
                    // wait until next cycle to do the pulse
                } else {
                    stepper_actual_pos_d--;
                    flip_d ^= 1;
                }
            } else if (sddelta > 0) {
                if (stepper_dir_d != +1) {
                    stepper_dir_d = +1;
                    // wait until next cycle to do the pulse
                } else {
                    // now do the actual pulse
                    stepper_actual_pos_d++;
                    flip_d ^= 1;
                }
            }
        } else {
            flip_d ^= 1;
        }
        
#ifdef STM32
        cycle_counter = *DWT_CYCCNT;
    }
#endif  // #ifdef STM32
}

void TIM3_IRQHandler(void)
{
#ifdef STM32
    if ((TIM3->SR & TIM_SR_UIF)) {
        TIM3->SR &= ~(TIM_SR_UIF);
    }
#endif  // #ifdef STM32
}

#ifdef __cplusplus
} // extern "C" {
#endif  // #ifdef __cplusplus

