tinic/lathe_motion_stm32/lathe_motion/src/main.cpp
                case 'C': {
                            static int32_t prev_target_z = 0;
                            static int32_t prev_target_x = 0;
                            static int32_t prev_target_d = 0;

                            size_t pos = 1;
                            bool ok_to_run = true;

                            if (buf_pos < (1 + size_of_crc)) {
                                send_invalid_response();
                                break;
                            }

                            if (buf[pos] != 'X' && 
                                buf[pos] != 'Z' &&
                                buf[pos] != 'C' &&
                                buf[pos] != 'D' &&
                                buf[pos] != 'S' && 
                                buf[pos] != 'R' && 
                                buf[pos] != 'P') {
                                ok_to_run = false;
                                send_invalid_response();
                                break;
                            }

                            if (buf[pos] == 'S') {
                            	cycle_buffer.reset();
                                if (cycle_buffer.empty() ||
                                    cycle_buffer.atend()) {
                                    send_invalid_response();
                                    break;
                                }
                                reload_cycle();
                                set_zero_pos();
                                set_current_run_mode(run_mode_cycle);
                                send_ok_response();
                                break;
                            }

                            if (buf[pos] == 'C') {
                            	if (current_run_mode == run_mode_cycle_pause) {
	                                set_current_run_mode(run_mode_cycle);
	                            }
                                send_ok_response();
                                break;
                            }

                            if (buf[pos] == 'P') {
                            	if (current_run_mode == run_mode_cycle) {
									set_current_run_mode(run_mode_cycle_pause);
								}
                                send_ok_response();
                                break;
                            }

                            set_current_run_mode(run_mode_none);

                            if (buf[pos] == 'R') {
                            	cycle_buffer.clear();
                                prev_target_z = 0;
                                prev_target_x = 0;
                                prev_target_d = 0;
                                send_ok_response();
                                break;
                            }


                            cycle_buffer::cycle_entry entry;

							int32_t buf_check_size = 1 + 1 + size_of_crc;
                            if (buf_pos < buf_check_size) {
                                send_invalid_response();
                                break;
                            }

                            entry.target_axs = (buf[pos] == 'X') ? 1 : ( (buf[pos] == 'D') ? 2 : 0); pos+=1;
                            
                            buf_check_size += 2;
                            if (buf_pos < buf_check_size) {
                                send_invalid_response();
                                break;
                            }

                            uint8_t flags = uint8_t(parse_hex02((const uint8_t *)&buf[pos])); pos += 2;


							int32_t target_pos_z = 0;                            
							int32_t target_pos_x = 0;                            
							int32_t target_pos_d = 0;         
							
							#define SET_Z_FLAG 0x01
							#define SET_X_FLAG 0x02
							#define SET_D_FLAG 0x04
							#define WAIT_FLAG  0x10

                            if (flags & SET_Z_FLAG) {
								buf_check_size += 24;
								if (buf_pos < buf_check_size) {
									send_invalid_response();
									break;
								}
								target_pos_z = int32_t(parse_hex08((const uint8_t *)&buf[pos])); pos += 8;
								entry.stepper_mul_z = int32_t(parse_hex08((const uint8_t *)&buf[pos])); pos += 8;
								entry.stepper_div_z = int32_t(parse_hex08((const uint8_t *)&buf[pos])); pos += 8;
                            } else {
								entry.stepper_mul_z = 0;
								entry.stepper_div_z = 1;
                            }

                            if (flags & SET_X_FLAG) {
								buf_check_size += 24;
								if (buf_pos < buf_check_size) {
									send_invalid_response();
									break;
								}
								target_pos_x = int32_t(parse_hex08((const uint8_t *)&buf[pos])); pos += 8;
								entry.stepper_mul_x = int32_t(parse_hex08((const uint8_t *)&buf[pos])); pos += 8;
								entry.stepper_div_x = int32_t(parse_hex08((const uint8_t *)&buf[pos])); pos += 8;
							} else {
								entry.stepper_mul_x = 0;
								entry.stepper_div_x = 1;
							}

                            if (flags & SET_D_FLAG) {
								buf_check_size += 24;
								if (buf_pos < buf_check_size) {
									send_invalid_response();
									break;
								}
								target_pos_d = int32_t(parse_hex08((const uint8_t *)&buf[pos])); pos += 8;
								entry.stepper_mul_d = int32_t(parse_hex08((const uint8_t *)&buf[pos])); pos += 8;
								entry.stepper_div_d = int32_t(parse_hex08((const uint8_t *)&buf[pos])); pos += 8;
							} else {
								entry.stepper_mul_d = 0;
								entry.stepper_div_d = 1;
							}

                            entry.wait_for_index_zero = (flags & WAIT_FLAG) ? 1 : 0;

                            entry.stepper_mul_z = -entry.stepper_mul_z;
                            entry.stepper_mul_x = -entry.stepper_mul_x;
                            entry.stepper_mul_d = -entry.stepper_mul_d;

                            if (entry.stepper_div_z <= 0 ||
                                entry.stepper_div_x <= 0 ||
                                entry.stepper_div_d <= 0) {
                                send_invalid_response();
                                break;
                            }

                            int32_t gcd_z = gcd(entry.stepper_mul_z, entry.stepper_div_z); entry.stepper_mul_z /= gcd_z; entry.stepper_div_z /= gcd_z;
                            int32_t gcd_x = gcd(entry.stepper_mul_x, entry.stepper_div_x); entry.stepper_mul_x /= gcd_x; entry.stepper_div_x /= gcd_x;
                            int32_t gcd_d = gcd(entry.stepper_mul_d, entry.stepper_div_d); entry.stepper_mul_d /= gcd_d; entry.stepper_div_d /= gcd_d;
                            
                            switch(entry.target_axs) {
                                case 0: {
                                	entry.target_pos = target_pos_z;
                                    if (entry.stepper_mul_z < 0 && entry.target_pos <= prev_target_z) {
                                        ok_to_run = false;
                                    }
                                    if (entry.stepper_mul_z > 0 && entry.target_pos >= prev_target_z) {
                                        ok_to_run = false;
                                    }
                                    if (entry.stepper_mul_z == 0 && entry.target_pos != prev_target_z) {
                                        ok_to_run = false;
                                    }
                                } break;
                                case 1: {
                                	entry.target_pos = target_pos_x;
                                    if (entry.stepper_mul_x < 0 && entry.target_pos <= prev_target_x) {
                                        ok_to_run = false;
                                    }
                                    if (entry.stepper_mul_x > 0 && entry.target_pos >= prev_target_x) {
                                        ok_to_run = false;
                                    }
                                    if (entry.stepper_mul_x == 0 && entry.target_pos != prev_target_x) {
                                        ok_to_run = false;
                                    }
                                } break;
                                case 2: {
                                	entry.target_pos = target_pos_d;
                                    if (entry.stepper_mul_d < 0 && entry.target_pos <= prev_target_d) {
                                        ok_to_run = false;
                                    }
                                    if (entry.stepper_mul_d > 0 && entry.target_pos >= prev_target_d) {
                                        ok_to_run = false;
                                    }
                                    if (entry.stepper_mul_d == 0 && entry.target_pos != prev_target_d) {
                                        ok_to_run = false;
                                    }
                                } break;
                            }

                            if (flags & SET_Z_FLAG) {
                            	prev_target_z = target_pos_z;
                            }
                            if (flags & SET_X_FLAG) {
                            	prev_target_x = target_pos_x;
                            }
                            if (flags & SET_D_FLAG) {
                            	prev_target_d = target_pos_d;
                            }
                            
							// push cycle
							cycle_buffer.push(entry);

                            if (cycle_buffer.atlimit()) {
                                ok_to_run = false;
                            }
							
                            if (ok_to_run) {
                                send_ok_response();
                            } else {
                            	cycle_buffer.clear();
								send_invalid_response();
                            }
                        } break;

                // Reset to zero
                case 'R': {
                            set_zero_pos();
                            send_ok_response();
                        } break;

                // Get raw status
                case 'S': {
							int16_t cnt = qep_counter();

                            static uint8_t sts[96] = { 0 };
                            size_t pos = 0;
                            
