tinic/lathe_motion_stm32/lathe_motion/src/main.cpp
                            write_hex02(&sts[pos], uint32_t(current_run_mode)); pos += 2; 

                            write_hex04(&sts[pos], uint32_t(absolute_tick)); pos += 4; 
                            write_hex04(&sts[pos], uint32_t(cycle_counter)); pos += 4; 
                            
                            write_hex08(&sts[pos], uint32_t(absolute_pos)); pos += 8; 
                            write_hex08(&sts[pos], uint32_t(absolute_idx)); pos += 8; 
                            write_hex04(&sts[pos], uint32_t(cnt)); pos += 4; 
                            write_hex04(&sts[pos], uint32_t(current_index_delta)); pos += 4; 

                            write_hex08(&sts[pos], uint32_t(stepper_actual_pos_z)); pos += 8; 
                            write_hex08(&sts[pos], uint32_t(stepper_actual_pos_x)); pos += 8; 
                            write_hex08(&sts[pos], uint32_t(stepper_actual_pos_d)); pos += 8; 
                            
							write_hex04(&sts[pos], uint32_t(cycle_buffer.index())); pos += 4; 
							write_hex04(&sts[pos], uint32_t(cycle_buffer.index_length())); pos += 4; 

                            uint16_t crc = CRC16(reinterpret_cast<const uint8_t *>(sts), pos);

                            sts[pos++] = uint8_t(int2hex[((crc>>12)&0xF)]);
                            sts[pos++] = uint8_t(int2hex[((crc>> 8)&0xF)]);
                            sts[pos++] = uint8_t(int2hex[((crc>> 4)&0xF)]);
                            sts[pos++] = uint8_t(int2hex[((crc>> 0)&0xF)]);
                            sts[pos++] = '\n';

                            // Send the ascii-fied data over UART
                            for (size_t c=0; c<pos; c++) {
                                put_char(sts[c]);
                            }
                        } break;

                default: {
                            send_invalid_response();
                        } break;

            }
            buf_pos = 0;
            break;
        }
    }
}

static void init_constants() 
{
    absolute_pos = 0;
    absolute_idx = 0;
    absolute_tick = 0;

    absolute_pos_start_offset = 0;

    stepper_actual_pos_z = 0;
    
    stepper_follow_mul_z = -60; // 0.1mm/rev
    stepper_follow_div_z = 1143;
    
    stepper_actual_pos_x = 0;
    
    stepper_follow_mul_x = 60 / 2; // 0.05mm/rev
    stepper_follow_div_x = 1143;

    stepper_actual_pos_d = 0;

    stepper_follow_mul_d = 0;
    stepper_follow_div_d = 1;
}

static void init_systick(void)
{
#ifdef STM32

    int tick_time = SystemCoreClock / 1000;  // Generate interrupt each 1 ms
    SysTick_Config(tick_time);               // Configure systick timer

#else  // #ifdef STM32

    systick_session = std::make_shared<systick_timer>();

#endif  // #ifdef STM32
}

static void init_clock(void)
{
#ifdef STM32

#ifdef STM32F103xB
    // Conf clock : 72MHz or 128Mhz using HSE 8MHz crystal w/ PLL X 9/16 (8MHz x 9 = 72MHz, 8MHz x 16 = 128MHz)
    FLASH->ACR      |= FLASH_ACR_LATENCY_2; // Two wait states, per datasheet
    RCC->CFGR       |= RCC_CFGR_PPRE1_2;    // prescale AHB1 = HCLK/2
    RCC->CR         |= RCC_CR_HSEON;        // enable HSE clock
    while( !(RCC->CR & RCC_CR_HSERDY) );    // wait for the HSEREADY flag
    
    RCC->CFGR       |= RCC_CFGR_PLLSRC;     // set PLL source to HSE

#if 1 // 128Mhz
    RCC->CFGR       |= RCC_CFGR_PLLMULL16;   // multiply by 9
#else  // #if 1 // 128Mhz
    RCC->CFGR       |= RCC_CFGR_PLLMULL9;   // multiply by 9
#endif  // #if 1 // 128Mhz

    RCC->CR         |= RCC_CR_PLLON;        // enable the PLL
    while( !(RCC->CR & RCC_CR_PLLRDY) );    // wait for the PLLRDY flag
    
    RCC->CFGR       |= RCC_CFGR_SW_PLL;     // set clock source to pll

    while( !(RCC->CFGR & RCC_CFGR_SWS_PLL) );    // wait for PLL to be CLK
    
    SystemCoreClockUpdate();                // calculate the SYSCLOCK value
#endif  // #ifdef STM32F103xB

#ifdef STM32F767xx
    FLASH->ACR      |= FLASH_ACR_LATENCY_4WS; // Four wait states
    while ((FLASH->ACR & FLASH_ACR_LATENCY) != FLASH_ACR_LATENCY_4WS);

    RCC->CR         |= RCC_CR_HSEON;        // enable HSE clock
    while( !(RCC->CR & RCC_CR_HSERDY) );    // wait for the HSEREADY flag

	//
	// Set to 216Mhz using HSE 8Mhz crystal w/ PLL
	//
	// Default on startup (96Mhz):
	//
	// PLLP  == 2
	// PLLN  == 192
	// PLLM  == 16
	//
	RCC->PLLCFGR &= ~(RCC_PLLCFGR_PLLM); // PLLP = 2
	RCC->PLLCFGR |= RCC_PLLCFGR_PLLM_2; // PLLM = 4
	RCC->PLLCFGR |= RCC_PLLCFGR_PLLN_3 | RCC_PLLCFGR_PLLN_4 | RCC_PLLCFGR_PLLN_6 | RCC_PLLCFGR_PLLN_7; // PLLN = 216;
    RCC->CR |= RCC_CR_PLLON;        // enable the PLL
    while( !(RCC->CR & RCC_CR_PLLRDY) );    // wait for the PLLRDY flag

    RCC->CFGR |= RCC_CFGR_SW_PLL;     // set clock source to pll
    while( !(RCC->CFGR & RCC_CFGR_SWS_PLL) );    // wait for PLL to be CLK

    SystemCoreClockUpdate();                // calculate the SYSCLOCK value
#endif  // #ifdef STM32F767xx
#else  // #ifdef STM32

#endif  // #ifdef STM32
}

static void init_led(void)
{
#ifdef STM32
#ifdef STM32F103xB
    RCC->APB2ENR |= RCC_APB2ENR_IOPCEN; // enable GPIO clock for LED
    LED_PORT->CRH    &= ~(GPIO_CRH_MODE13 | GPIO_CRH_CNF13);  // reset pin MODE / CNF
    LED_PORT->CRH    |=  (GPIO_CRH_MODE13_1 | GPIO_CRH_MODE13_0);    // MODE: 50Mhz ouput CNF: PP
#endif  // #ifdef STM32F103xB

#ifdef STM32F767xx
    RCC->APB1ENR |= RCC_AHB1ENR_GPIOAEN; // enable GPIO clock for LED
#endif  // #ifdef STM32F767xx
#endif  // #ifdef STM32
}

static void init_usart(uint32_t baudrate)
{
#ifdef STM32
    RCC->APB2ENR |= RCC_APB2ENR_USART1EN; // enable USART1 clock

#ifdef STM32F103xB
    // UART on pins PB6 and PB7
    RCC->APB2ENR    |= RCC_APB2ENR_AFIOEN;  // enable AFIO clock
    RCC->APB2ENR    |= RCC_APB2ENR_IOPAEN | RCC_APB2ENR_IOPBEN | RCC_APB2ENR_IOPCEN;// enable GPIOA, GPIOB, GPIOC clock

    //use AFIO_MAPR register to remap alternate functions to use USART 1 TX and RX on PB6 and PB7
    //Ref 7.4.2 and 6.3.7 in st manual
    AFIO->MAPR |= AFIO_MAPR_USART1_REMAP;
    
    GPIOB->CRL &= ~(GPIO_CRL_CNF6 | GPIO_CRL_MODE6);  // reset PB6
    GPIOB->CRL &= ~(GPIO_CRL_CNF7 | GPIO_CRL_MODE7);  // reset PB7
    
    GPIOB->CRL |= GPIO_CRL_MODE6_1 | GPIO_CRL_MODE6_0;  // 0b11 50MHz output

    GPIOB->CRL |= GPIO_CRL_CNF6_1;    // PB6: output @ 50MHz - Alt-function Push-pull
    GPIOB->CRL |= GPIO_CRL_CNF7_0;    // PB7 RX - Mode = 0b00 (input) - CNF = 0b01 (input floating)
    
